.doom.d/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

; Define This-System
(setq this-system "kestrel")
(setq system-category-1 '("kestrel" "basilisk" "adjudicator"))
(setq system-category-2 '("kestrel"))

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Tyler Starr"
      user-mail-address "starrtyler88@gmail.com")

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

;; Modules
(load! "+ui")
(load! "+org")
(load! "+gtd")
